Workshop4/jmeter/results/html-report-all/statistics.json
{
  "POST Java /auth/register" : {
    "transaction" : "POST Java /auth/register",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 7.0,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 31.0,
    "throughput" : 1.295001295001295,
    "receivedKBytesPerSec" : 3.3804086538461537,
    "sentKBytesPerSec" : 0.0
  },
  "POST /categories" : {
    "transaction" : "POST /categories",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 1.0,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3082155939298796,
    "receivedKBytesPerSec" : 3.414902619701727,
    "sentKBytesPerSec" : 0.0
  },
  "GET /books" : {
    "transaction" : "GET /books",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.6,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.307531380753138,
    "receivedKBytesPerSec" : 3.4131165827667367,
    "sentKBytesPerSec" : 0.0
  },
  "POST /books" : {
    "transaction" : "POST /books",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 1.0,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3078733978550876,
    "receivedKBytesPerSec" : 3.4140093676432124,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 1.4000000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.4499999999999957,
    "pct3ResTime" : 31.0,
    "throughput" : 12.916559028674762,
    "receivedKBytesPerSec" : 33.71676004262464,
    "sentKBytesPerSec" : 0.0
  },
  "GET /users" : {
    "transaction" : "GET /users",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.6,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3082155939298796,
    "receivedKBytesPerSec" : 3.414902619701727,
    "sentKBytesPerSec" : 0.0
  },
  "GET /categories" : {
    "transaction" : "GET /categories",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.8,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3078733978550876,
    "receivedKBytesPerSec" : 3.4140093676432124,
    "sentKBytesPerSec" : 0.0
  },
  "POST Java /auth/login" : {
    "transaction" : "POST Java /auth/login",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.8,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3065064018813692,
    "receivedKBytesPerSec" : 3.410441027567285,
    "sentKBytesPerSec" : 0.0
  },
  "GET /loans" : {
    "transaction" : "GET /loans",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.6,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.3082155939298796,
    "receivedKBytesPerSec" : 3.414902619701727,
    "sentKBytesPerSec" : 0.0
  },
  "GET /books/available" : {
    "transaction" : "GET /books/available",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.8,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.307531380753138,
    "receivedKBytesPerSec" : 3.4131165827667367,
    "sentKBytesPerSec" : 0.0
  },
  "GET Python /health" : {
    "transaction" : "GET Python /health",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.8,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.3068478829064296,
    "receivedKBytesPerSec" : 3.4113324130946157,
    "sentKBytesPerSec" : 0.0
  }
}